iamankushpandit/esp_ai/sdkconfig.defaults
# ---- Target: Freenove FNK0104B (ESP32-S3R8: 8MB octal PSRAM, 16MB quad flash)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- CPU / cache. Caches are carved from internal SRAM; keep them at the
# conformer reference sizes so a contiguous 256 KB internal STT block fits.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_16KB=y
CONFIG_ESP32S3_DATA_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_32B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ---- PSRAM: octal, 80 MHz. Not added to malloc() by default; allocations
# must ask for MALLOC_CAP_SPIRAM explicitly so memory placement is deliberate.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=n

# ---- Console: USB-Serial/JTAG (board enumerates as USB Serial Device)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_INT_WDT_TIMEOUT_MS=800

# ---- FATFS on SD: long file names, exFAT not needed (FAT32)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=16384

# ---- Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_FREERTOS_HZ=1000

# ---- Radio off: everything is offline
CONFIG_BT_ENABLED=n

# ---- Wake word: esp-sr WakeNet9 "Hey Ivy" (stock model, until a custom "Braino")
CONFIG_MODEL_IN_FLASH=y
CONFIG_SR_WN_WN9_HEYIVY_TTS2=y
CONFIG_SR_MN_EN_NONE=y
CONFIG_SR_MN_CN_NONE=y
